Autodesk.Revit.DB.MeshArray
An array that contains meshes.

Autodesk.Revit.DB.MeshArray.Insert(Autodesk.Revit.DB.Mesh,System.Int32)
System.Int32
Insert the specified mesh into the array.
item: The mesh to be inserted into the array.
index: The mesh will be inserted before this index.
Returns: Returns whether the mesh was inserted into the array.

Autodesk.Revit.DB.MeshArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.MeshArray.ReverseIterator
Autodesk.Revit.DB.MeshArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.MeshArray.ForwardIterator
Autodesk.Revit.DB.MeshArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.MeshArray.Append(Autodesk.Revit.DB.Mesh)
void
Add the mesh to the end of the array.
item: The mesh to be added.

Autodesk.Revit.DB.MeshArray.Clear
void
Removes every mesh from the array, rendering it empty.

Autodesk.Revit.DB.MeshArray.Size
System.Int32
get
Returns the number of meshes that are in the array.

Autodesk.Revit.DB.MeshArray.Item(System.Int32)
System.Object
Gets or sets a mesh at a specified index within the array.
index: The index of the mesh to be set or retrieved.
Returns: Returns the mesh at the specified index.

Autodesk.Revit.DB.MeshArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.